# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
# tap 'homebrew/dupes' # deprecated and removed
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install more recent versions of some macOS tools
# brew 'homebrew/dupes/grep' # deprecated and removed

# Install wget
brew 'wget'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'hub'
brew 'tree'
brew 'mas'
brew 'node'
brew 'trash'
brew 'wget'

# Development
brew 'php71'
# brew 'php71-intl' # no longer a formula
brew 'mariadb'

# Apps
cask 'dropbox'
cask 'google-chrome'
cask 'sequel-pro'
cask 'shuttle'
cask 'slack'
cask 'Spotify'
cask 'sublime-text'
cask 'tower'
cask 'transmit'
cask 'vlc'
